<a href="https://colab.research.google.com/github/KorKoor/Python-Maestra-Liz/blob/main/Ejercicio6.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Ejercicio Uniones

In [3]:
import pandas as pd

#Crear dos DataFrames

In [5]:
df1 = pd.DataFrame({
    'ID': [1, 2 ,3 ,4],
    'Nombre': ['Ana', 'Juan', 'Maria', 'Carlos'],
    'Departamento': ['Ventas', 'IT', 'Marketing', 'RH']
})

df2 = pd.DataFrame({
    'ID': [3, 4, 5, 6],
    'Salario': ['50000', '60000', '55000', '65000']
})

print("DataFrame 1:")
print(df1)
print("DataFrame 2:")
print(df2)

DataFrame 1:
   ID  Nombre Departamento
0   1     Ana       Ventas
1   2    Juan           IT
2   3   Maria    Marketing
3   4  Carlos           RH
DataFrame 2:
   ID Salario
0   3   50000
1   4   60000
2   5   55000
3   6   65000

#Fusión Inner

In [6]:
inner_merge = pd.merge(df1, df2, on='ID', how='inner')
print("Fusión Inner:")
print(inner_merge)

Fusión Inner:
   ID  Nombre Departamento Salario
0   3   Maria    Marketing   50000
1   4  Carlos           RH   60000

#Fusión Outer

In [7]:
outer_merge = pd.merge(df1, df2, on='ID', how='outer')
print("Fusión Outer:")
print(outer_merge)

Fusión Outer:
   ID  Nombre Departamento Salario
0   1     Ana       Ventas     NaN
1   2    Juan           IT     NaN
2   3   Maria    Marketing   50000
3   4  Carlos           RH   60000
4   5     NaN          NaN   55000
5   6     NaN          NaN   65000

# Fusión left

In [10]:
left_merge = pd.merge(df1, df2, on='ID', how='left')
print("Fusión Left:")
print(left_merge)

Fusión Left:
   ID  Nombre Departamento Salario
0   1     Ana       Ventas     NaN
1   2    Juan           IT     NaN
2   3   Maria    Marketing   50000
3   4  Carlos           RH   60000

# Fusión Right

In [11]:
right_merge = pd.merge(df1, df2, on='ID', how='right')
print("Fusión Right:")
print(right_merge)

Fusión Right:
   ID  Nombre Departamento Salario
0   3   Maria    Marketing   50000
1   4  Carlos           RH   60000
2   5     NaN          NaN   55000
3   6     NaN          NaN   65000

# Concatenación

In [15]:
df3 = pd.DataFrame({
    'ID': [7, 8],
    'Nombre': ['Sofia', 'Pedro'],
    'Departamento': ['Finanzas', 'Ventas']
})

concatenated1 = pd.concat([df1, df3])
print("Concatenación de DaraFrames:")
print(concatenated1)

concatenated2 = pd.concat([concatenated1, df2])
print("Concatenación de DaraFrames:")
print(concatenated2)

Concatenación de DaraFrames:
   ID  Nombre Departamento
0   1     Ana       Ventas
1   2    Juan           IT
2   3   Maria    Marketing
3   4  Carlos           RH
0   7   Sofia     Finanzas
1   8   Pedro       Ventas
Concatenación de DaraFrames:
   ID  Nombre Departamento Salario
0   1     Ana       Ventas     NaN
1   2    Juan           IT     NaN
2   3   Maria    Marketing     NaN
3   4  Carlos           RH     NaN
0   7   Sofia     Finanzas     NaN
1   8   Pedro       Ventas     NaN
0   3     NaN          NaN   50000
1   4     NaN          NaN   60000
2   5     NaN          NaN   55000
3   6     NaN          NaN   65000